{"class_name": "Model", "config": {"name": "POS", "layers": [{"name": "wordSpelling", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 271, 24], "dtype": "float32", "sparse": false, "name": "wordSpelling"}, "inbound_nodes": []}, {"name": "wordToken", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 271], "dtype": "float32", "sparse": false, "name": "wordToken"}, "inbound_nodes": []}, {"name": "InputCharEmbedding", "class_name": "TimeDistributed", "config": {"name": "InputCharEmbedding", "trainable": true, "layer": {"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 24], "dtype": "float32", "input_dim": 81, "output_dim": 25, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": 24}}}, "inbound_nodes": [[["wordSpelling", 0, 0, {}]]]}, {"name": "InputEmbedding", "class_name": "Embedding", "config": {"name": "InputEmbedding", "trainable": false, "batch_input_shape": [null, 271], "dtype": "float32", "input_dim": 50001, "output_dim": 150, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": 271}, "inbound_nodes": [[["wordToken", 0, 0, {}]]]}, {"name": "char-basedFeaturesLSTM", "class_name": "TimeDistributed", "config": {"name": "char-basedFeaturesLSTM", "trainable": true, "layer": {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}}}, "inbound_nodes": [[["InputCharEmbedding", 0, 0, {}]]]}, {"name": "POS-input", "class_name": "Concatenate", "config": {"name": "POS-input", "trainable": true, "axis": -1}, "inbound_nodes": [[["InputEmbedding", 0, 0, {}], ["char-basedFeaturesLSTM", 0, 0, {}]]]}, {"name": "POSTags-PredicterLSTM", "class_name": "Bidirectional", "config": {"name": "POSTags-PredicterLSTM", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["POS-input", 0, 0, {}]]]}, {"name": "PosTagsExtractor", "class_name": "TimeDistributed", "config": {"name": "PosTagsExtractor", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 48, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["POSTags-PredicterLSTM", 0, 0, {}]]]}, {"name": "POSTags-SequenceDetecterLSTM", "class_name": "Bidirectional", "config": {"name": "POSTags-SequenceDetecterLSTM", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["PosTagsExtractor", 0, 0, {}]]]}, {"name": "Output", "class_name": "TimeDistributed", "config": {"name": "Output", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 48, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["POSTags-SequenceDetecterLSTM", 0, 0, {}]]]}], "input_layers": [["wordToken", 0, 0], ["wordSpelling", 0, 0]], "output_layers": [["Output", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}